/* 
   Localizable.strings
   BOOM

   Created by Federico Filipponi on 05/04/10.
   Copyright 2010 Factor Software. All rights reserved.
 */
// Tooltips
"UPLOADSCORES_TOOLTIP" = "If checked the game will try to upload the local scores to Factor Software’s Web site whenever a new high score is achieved";
"DOWNLOADSCORES_TOOLTIP" = "If checked the game will automatically try to download the online scores from Factor Software’s Web site whenever the online scores table is displayed";
"DELETESAVEDGAME_TOOLTIP" = "Delete the currently selected saved game";
// Keyboard strings
"Return" = "Return";
"Tab" = "Tab";
"Space" = "Space";
"Delete" = "Delete";
"ESC" = "ESC";
"Right Command" = "Right Command"; 
"Left Command" = "Left Command";
"Left Shift" = "Left Shift";
"Caps Lock" = "Caps Lock";
"Left Option" = "Left Option";
"Left Control" = "Left Control";
"Right Shift" = "Right Shift"; 
"Right Option" = "Right Option";
"Right Control" = "Right Control";
"Clear" = "Clear";
"Enter" = "Enter";
"Help" = "Help";
"Home" = "Home";
"Page Up" = "Page Up";
"Del" = "Del";
"End" = "End";
"Page Down" = "Page Down"; 
"Left Arrow" = "Left Arrow";
"Right Arrow" = "Right Arrow";
"Down Arrow" = "Down Arrow";
"Up Arrow" = "Up Arrow";
// Alert strings
"Key" = "Key";
"Button" = "Button";
"already in use" = "already in use";
"REGISTRATION_THANKS" = "Thank you for registering your copy of BOOM!";
"REGISTRATION_THANKS_MSG" = "Please keep your purchase confirmation e-mail message for future reference, as it contains your user name and registration code.";
"BAD_REGISTRATION_DATA" = "Sorry, your registration information is invalid.\nYour copy of BOOM is not registered!";
"BAD_REGISTRATION_DATA_MSG" = "Please enter your user name and registration code exactly as they appear on your purchase confirmation message.";
"CLEAR_SCORES_WARNING" = "Are you sure you want to clear the scores?";
"CLEAR_SCORES_WARNING_MSG" = "This operation cannot be undone.";
"NO_SAVE_GAME" = "Sorry, this feature is only available in the registered version of BOOM!\n\nIf you'd like to be able to save games and restart from where you left, please buy BOOM. Thank you!";
"NO_ONLINE_SCORES" = "Sorry, access to the online scores system is only available in the registered version of BOOM.\n\nIf you'd like to share your scores with other players online, please buy BOOM. Thank you!";
"BUY_THE_GAME_MSG" = "Click on “Buy BOOM...” to purchase this game now (you need an active Internet connection).";
"BAD_SCORES_DATA" = "An error occurred while processing received scores data.";
"BAD_XML_DATA" = "An error occurred while processing received XML data.";
"GAME_UP_TO_DATE" = "You are using the most recent release of BOOM, version %1$@.";
"GAME_UP_TO_DATE_MSG" = "You do not need to upgrade.";
"CONNECTION_ERROR" = "An error occurred while connecting to the remote server.";
"CONNECTION_FAILED" = "Connection failed!";
"CONNECTION_FAILED_MSG" = "The connection could not be initialized.";
"ONLINE_SCORES_ACCESS" = "To avoid server overload, manual access requests to the online scores system are limited to one every 30 seconds.";
"ONLINE_SCORES_ACCESS_MSG" = "Please try again in %1$u seconds.";
"SCORES_LOADING_ERROR" = "An error occurred while loading high scores from preferences.";
"SCORES_SAVING_ERROR" = "An error occurred while saving high scores to preferences.";
"SCORES_SERVER_ERROR" = "The operation could not be completed because the server reported an error.";
"GAME_SAVING_NODIR" = "An error occurred while creating the save game directory.";
"GAME_SAVING_OK" = "The current game has been successfully saved to disk.";
"GAME_SAVING_ERROR" = "An error occurred while saving the current game to disk.";
"GAME_LOADING_ERROR" = "An error occurred while loading the saved game from disk.";
"ERROR_DESCRIPTION_MSG" = "Error description: “%1$@”";
"CHEAT_WARNING" = "You activated a cheat mode.";
"CHEAT_WARNING_MSG" = "OK, but be aware that scores aren’t saved when cheating.";
"QUIT_IN_GAME" = "Are you sure you want to quit?";
"QUIT_IN_GAME_MSG" = "You will lose your current score.";
"DELETE_SAVED_GAME_WARNING" = "Are you sure you want to delete the selected saved game?";
"DELETE_SAVED_GAME_WARNING_MSG" = "The corresponding file will be moved to the Trash.";
"KRM_GENERAL_ERROR" = "An error occurred that prevented the transaction from completing.\nPlease try again using the web store.";
"KRM_ORDER_ERROR" = "An error occured while processing the transaction.\nPlease contact Factor Software at fedefil@factor-software.com.";
"KRM_ERROR_MSG" = "Error code: %1$u";
"Yes" = "Yes";
"unknown error" = "unknown error";
"Buy BOOM..." = "Buy BOOM...";
"Not Yet" = "Not Yet";
"Quit" = "Quit";
"Cancel" = "Cancel"; 
// Network Access
"Connecting..." = "Connecting...";
"Downloading scores..." = "Downloading scores...";
"Uploading scores..." = "Uploading scores...";
"Retrieving update info..." = "Retrieving update info...";
// Game strings
"Registered to" = "Registered to";
"NOT_REGISTERED" = "•••• NOT REGISTERED! ••••";
"EMPTY_STRING" = "~~~~~~~~~~";
"Pause" = "Pause";
"Unpause" = "Unpause";
"PAUSED" = "PAUSED";
"Press Cmd-P to unpause" = "Press Cmd-P to unpause";
"Loading..." = "Loading...";
"Factor Software presents" = "Factor Software presents";
"created by" = "created by";
"Federico Filipponi" = "Federico Filipponi";
"NEW GAME" = "NEW GAME";
"OPEN GAME" = "OPEN GAME";
"PREFERENCES" = "PREFERENCES";
"SCORES" = "SCORES";
"INFO" = "INFO";
"QUIT" = "QUIT";
"DEMO" = "DEMO";
"GET READY!" = "GET READY!";
"TIME BONUS!" = "TIME BONUS!";
"TOP BOMBERS" = "TOP BOMBERS";
"credits" = "credits";
"insert coin" = "insert coin";
"Name" = "Name";
"Score" = "Score";
"WORLDWIDE TOP BOMBERS" = "WORLDWIDE TOP BOMBERS";
"Level" = "Level";
"[press ESC to exit]" = "[press ESC to exit]";
"press a key or click to continue" = "press a key or click to continue";
"Date" = "Date";
"score" = "score";
"GAME" = "GAME";
"OVER" = "OVER";
"EXIT" = "EXIT";
"<< Prev" = "<< Prev";
"Next >>" = "Next >>";
"Local Scores" = "Local Scores";
"Online Scores" = "Online Scores";
"Upload" = "Upload";
"Download" = "Download";
"Last updated" = "Last updated";
"NOT_YET_UPDATED" = "- not yet updated -";
"BOOM Saved Game" = "BOOM Saved Game";
"cheat activated" = "cheat activated";
// Message strings
"MESSAGE_STRING_0" = "Thank you for registering your copy of BOOM.";
"MESSAGE_STRING_1" = "Welcome to BOOM";
"MESSAGE_STRING_2" = "A Factor Software production";
"MESSAGE_STRING_3" = "Code & Graphics: Federico Filipponi";
"MESSAGE_STRING_4" = "Sounds & Music: George E. Kouba, Jr.";
"MESSAGE_STRING_5" = "MGGame Library: Sebastian Wegner";
"MESSAGE_STRING_6" = "MGGame copyright © McSebi Software. All rights reserved.";
"MESSAGE_STRING_7" = "This game is SHAREWARE. If you enjoy it please buy it.";
// Info titles
"OUR HEROES" = "OUR HEROES";
"THE STORY" = "THE STORY";
"THE BADDIES" = "THE BADDIES";
"THE GOODIES" = "THE GOODIES";
"CREDITS" = "CREDITS";
// Info strings
"INFO_STRING_1_1" = "This is You";
"INFO_STRING_1_2" = "And this is your buddy";
"INFO_STRING_1_3" = "An Alien";
"INFO_STRING_2_1" = "Soldier";
"INFO_STRING_2_2" = "Sgt. Cool";
"INFO_STRING_2_3" = "Thick Lizzy";
"INFO_STRING_2_4" = "Mean-o-Taur";
"INFO_STRING_2_5" = "Gunner";
"INFO_STRING_2_6" = "The “Thing”";
"INFO_STRING_2_7" = "Ghost";
"INFO_STRING_2_8" = "Smoulder";
"INFO_STRING_2_9" = "Skully";
"INFO_STRING_2_10" = "H.R. Giggler";
"INFO_STRING_3_1" = "Some blocks reveal an occasional bonus item when destroyed with bombs.";
"INFO_STRING_3_2" = "Obviously not all the game elements are shown here. There’s more to discover while playing BOOM.";
"INFO_STRING_4_1" = "Code & Graphics";
"INFO_STRING_4_2" = "Federico Filipponi";
"INFO_STRING_4_3" = "Sounds & Music";
"INFO_STRING_4_4" = "George E. Kouba, Jr.";
"INFO_STRING_4_5" = "MGGame Library";
"INFO_STRING_4_6" = "Sebastian Wegner";
"INFO_STRING_4_7" = "Loading Screen Artwork";
"INFO_STRING_4_8" = "Raymond Zachariasse";
"INFO_STRING_4_9" = "Tempesta Seven Fonts";
"INFO_STRING_4_10" = "Yusuke Kamiyamane";
// Info texts
"INFO_TEXT_1_1" = "Not the toughest space marine currently on duty, but surely stupid enough to accept a mission with no return.";
"INFO_TEXT_1_2" = "Luckily you can count on your comrade to get rid of the enemy. Just try not to hurt each other.";
"INFO_TEXT_1_3" = "Really you need one? Ok.\nIt’s happened again. The Earth is facing a new alien threat and who’s called to save our beloved planet? You guessed!\n\nThe aliens have the capability of transform themselves in all sort of deadly creatures. Basically, they act like parasites, attacking humans, animals and even machines and turning them into lethal killers.\n\nYour mission is to penetrate 8 alien infested areas, each one divided in 10 sub-zones, eliminate all enemies using your bombs and finally kick the Big Alien Boss back to where he came from.";
"INFO_TEXT_2_1" = "This only apparently human creature is pretty stupid. Moves erratically. Almost harmless.";
"INFO_TEXT_2_2" = "He’s tough, he’s mean, he wears shades.\nIn fact, the only difference with the soldier is a slightly higher fire rate.";
"INFO_TEXT_2_3" = "Part man, part reptile, all nastiness.\nThis ugly beast casts deadly fireballs.";
"INFO_TEXT_2_4" = "A sort of a cross between a man and a bull on steroids. Fast and extremely vicious.";
"INFO_TEXT_2_5" = "Another former human being.\nHe holds a rapid fire pulse rifle.\nVeeery dangerous!";
"INFO_TEXT_2_6" = "The aliens’ favourite pet.\nLuckily our dogs don’t spit energy bolts.";
"INFO_TEXT_2_7" = "This creature from beyond is unarmed but his fast and incessant attacks can be very annoying.";
"INFO_TEXT_2_8" = "A fat and ugly psycho killer. Keep away from his lethal flame-thrower if you want to survive.";
"INFO_TEXT_2_9" = "A biomechanical creature.\nIts plasma cannon can wipe you out in seconds.";
"INFO_TEXT_2_10" = "Your worst nightmare.\nThe ultimate biological weapon. Throws radioactive magma and runs like a demon.";
"INFO_TEXT_3_1" = "Gives you two energy points. Very handy.";
"INFO_TEXT_3_2" = "Quick match.\nLasts one life.";
"INFO_TEXT_3_3" = "Speed-up.\nMakes you run faster for 20 secs.";
"INFO_TEXT_3_4" = "Restores all your energy. Go for it!";
"INFO_TEXT_3_5" = "Wider explosions (up to 4 blocks).\nLasts one life.";
"INFO_TEXT_3_6" = "Zapper (rare).\nWipes off all breakable blocks.";
"INFO_TEXT_3_7" = "Gives you more bombs (up to 8).\nLasts one life.";
"INFO_TEXT_3_8" = "Shield.\nMakes you invincible for 20 secs.";
"INFO_TEXT_3_9" = "Sudden Death (rare).\nEliminates all the enemies at a blow.";
"INFO_TEXT_3_10" = "Coins are scattered around the levels. If you manage to collect all the coins in one level the aliens go crazy and temporarily loose their mimetic capability, revealing their true nature.\nAliens killed during this phase (which lasts 3O seconds) leave a letter on the playing field. Collect all the letters forming the word EXTRA and you are awarded with an extra life.";
// End of game strings
"END_STRING_1" = "YOU HAVE WON!!";
"END_STRING_2" = "You reached the last of the alien infested zones";
"END_STRING_3" = "and defeated the Big Alien Boss himself.";
"END_STRING_4" = "Not exactly like eating a piece of cake, eh?";
"END_STRING_5" = "Well, now the Earth is safe, you are a hero,";
"END_STRING_6" = "interviews, autographs and all the rest.";
"END_STRING_7" = "But, wait a minute?";
"END_STRING_8" = "What is that strange thing in the sky?";
"END_STRING_9" = "OH NO! NOT AGAIN!!";